Return-Path: <netdev+bounces-165558-lists+netdev=lfdr.de@vger.kernel.org>
X-Original-To: lists+netdev@lfdr.de
Delivered-To: lists+netdev@lfdr.de
Received: from ny.mirrors.kernel.org (ny.mirrors.kernel.org [147.75.199.223])
	by mail.lfdr.de (Postfix) with ESMTPS id 774E9A32817
	for <lists+netdev@lfdr.de>; Wed, 12 Feb 2025 15:10:50 +0100 (CET)
Received: from smtp.subspace.kernel.org (relay.kernel.org [52.25.139.140])
	(using TLSv1.2 with cipher ECDHE-ECDSA-AES256-GCM-SHA384 (256/256 bits))
	(No client certificate requested)
	by ny.mirrors.kernel.org (Postfix) with ESMTPS id 47A2C1630B9
	for <lists+netdev@lfdr.de>; Wed, 12 Feb 2025 14:10:46 +0000 (UTC)
Received: from localhost.localdomain (localhost.localdomain [127.0.0.1])
	by smtp.subspace.kernel.org (Postfix) with ESMTP id E6F7F20FA84;
	Wed, 12 Feb 2025 14:10:35 +0000 (UTC)
Authentication-Results: smtp.subspace.kernel.org;
	dkim=pass (2048-bit key) header.d=Nvidia.com header.i=@Nvidia.com header.b="J3pnZqNi"
X-Original-To: netdev@vger.kernel.org
Received: from NAM10-DM6-obe.outbound.protection.outlook.com (mail-dm6nam10on2072.outbound.protection.outlook.com [40.107.93.72])
	(using TLSv1.2 with cipher ECDHE-RSA-AES256-GCM-SHA384 (256/256 bits))
	(No client certificate requested)
	by smtp.subspace.kernel.org (Postfix) with ESMTPS id 86A9920F088;
	Wed, 12 Feb 2025 14:10:33 +0000 (UTC)
Authentication-Results: smtp.subspace.kernel.org; arc=fail smtp.client-ip=40.107.93.72

 =?us-ascii?Q?MrSBaYEJHEbOSpdn9AC1zQKx/z9a5m1LUbdO+/H3AYO+8/h90/89M0aMH6VL?=
 =?us-ascii?Q?xi18UgUfkOnLtf+t3YLc2F5pxfRaeblkIv4PwSQxydqIA0BDH232cFfQjfNP?=
 =?us-ascii?Q?Ygc64HgulstOlI9YBifTxR8ZzIaVyptGuDfKUM8ow0p3zi5ZNxYamEY42d4D?=
 =?us-ascii?Q?tT/BZ0BO8BU5vaeZdh/Jrf34st9/6/keR6OMkDp9IBg8ZQJjoJ2oHr3XnGBj?=
 =?us-ascii?Q?+t7g1S+KdGl07X6GX4CXW4YlKz25H2sTw4JauamvsofC/ujz4/gUSYTnoLfD?=
 =?us-ascii?Q?2gfBWela+LTVdB02biStDRNXHj7ioIM/V578HFjHSlq72F588NMcZlud8J+L?=
 =?us-ascii?Q?52cA2/i2QdkG3YKPXBw+XhmB9SXsfUlZ4QxVvU/uIiDtlHIQHmcAtsf3J0su?=
 =?us-ascii?Q?J0BIFrUMZIEtFrhEQ5O+wXAda3pBG1eVlzoJxPKyK/NIDrQAF7HnvqyK+MZV?=
 =?us-ascii?Q?NWG6aj96sbYb5TtZKbTSSW+OE3wgzezS27U/LdPGRNx6F5X9tndDVGF88jzo?=
 =?us-ascii?Q?ALH1wOmHHIRTzPhcKZm9G/SB2jGGtUgJBkijZ3Sns4kos9zV5OF/QUb+28Ue?=
 =?us-ascii?Q?SfimuIvf2p/idO/ZDOjOyLt1+prFMQNJ7PTSL79Lwq/92eZHslLcPy5yvXNt?=
 =?us-ascii?Q?8R4cjrKgceTcTAO+SB83EiyHwTX9wmlcgBfy7gBwn1EvY2X81JmkiNWRwEDW?=
 =?us-ascii?Q?XCERI8MHutLB7uidqbITveGraedQhftU1IUTE8znbmCDldw0olksLQ0/LynW?=
 =?us-ascii?Q?z7qpIS/J92NI/o0HizRBodSgVONQL8aFJ0kPd+ERm/QikxBLn/jX9W7eLhCt?=
 =?us-ascii?Q?UNh2Wp8g1fY1DD40MfgMYKsms385RlYCkyTauSjZ9Z7FvFRN1Bh0FCIsiaTE?=
 =?us-ascii?Q?9MWDbyQO7orJFDGRHXS6MHnr8/VREnTxE7kOpTdY239ySh3LCdYJ5JYyBG83?=
 =?us-ascii?Q?LQyPIzgfEGLN1k9ZHJY7eAIOjzs32m2p8mo7IXYr+AglPG1tMWw/zdxpqcdd?=
 =?us-ascii?Q?VZSjokmRqTRsx8k=3D?=
X-Forefront-Antispam-Report:
	CIP:216.228.117.161;CTRY:US;LANG:en;SCL:1;SRV:;IPV:NLI;SFV:NSPM;H:mail.nvidia.com;PTR:dc6edge2.nvidia.com;CAT:NONE;SFS:(13230040)(1800799024)(376014)(7416014)(82310400026)(36860700013);DIR:OUT;SFP:1101;
X-OriginatorOrg: Nvidia.com
X-MS-Exchange-CrossTenant-OriginalArrivalTime: 12 Feb 2025 14:10:23.0085
 (UTC)
X-MS-Exchange-CrossTenant-Network-Message-Id: 62318a9d-ccba-4f9d-75c7-08dd4b6efdb5
X-MS-Exchange-CrossTenant-Id: 43083d15-7273-40c1-b7db-39efd9ccc17a
X-MS-Exchange-CrossTenant-OriginalAttributedTenantConnectingIp: TenantId=43083d15-7273-40c1-b7db-39efd9ccc17a;Ip=[216.228.117.161];Helo=[mail.nvidia.com]
X-MS-Exchange-CrossTenant-AuthSource:
	SJ1PEPF00002314.namprd03.prod.outlook.com
X-MS-Exchange-CrossTenant-AuthAs: Anonymous
X-MS-Exchange-CrossTenant-FromEntityHeader: HybridOnPrem
X-MS-Exchange-Transport-CrossTenantHeadersStamped: PH7PR12MB6884

Remove the hidden assumption that options are allocated at the end of
the struct, and teach the compiler about them using a flexible array.

With this, we can revert the unsafe_memcpy() call we have in
tun_dst_unclone() [1], and resolve the false field-spanning write
warning caused by the memcpy() in ip_tunnel_info_opts_set().

The layout of struct ip_tunnel_info remains the same with this patch.
Before this patch, there was an implicit padding at the end of the
struct, options would be written at 'info + 1' which is after the
padding.
This will remain the same as this patch explicitly aligns 'options'.
The alignment is needed as the options are later casted to different
structs, and might result in unaligned memory access.

Pahole output before this patch:
struct ip_tunnel_info {
    struct ip_tunnel_key       key;                  /*     0    64 */

    /* XXX last struct has 1 byte of padding */

    /* --- cacheline 1 boundary (64 bytes) --- */
    struct ip_tunnel_encap     encap;                /*    64     8 */
    struct dst_cache           dst_cache;            /*    72    16 */
    u8                         options_len;          /*    88     1 */
    u8                         mode;                 /*    89     1 */

    /* size: 96, cachelines: 2, members: 5 */
    /* padding: 6 */
    /* paddings: 1, sum paddings: 1 */
    /* last cacheline: 32 bytes */
};

Pahole output after this patch:
struct ip_tunnel_info {
   struct ip_tunnel_key       key;                  /*     0    64 */

   /* XXX last struct has 1 byte of padding */

   /* --- cacheline 1 boundary (64 bytes) --- */
   struct ip_tunnel_encap     encap;                /*    64     8 */
   struct dst_cache           dst_cache;            /*    72    16 */
   u8                         options_len;          /*    88     1 */
   u8                         mode;                 /*    89     1 */

   /* XXX 6 bytes hole, try to pack */

   u8                         options[] __attribute__((__aligned__(8))); /*    96     0 */

   /* size: 96, cachelines: 2, members: 6 */
   /* sum members: 90, holes: 1, sum holes: 6 */
   /* paddings: 1, sum paddings: 1 */
   /* forced alignments: 1, forced holes: 1, sum forced holes: 6 */
   /* last cacheline: 32 bytes */
} __attribute__((__aligned__(8)));

[1] Commit 13cfd6a6d7ac ("net: Silence false field-spanning write warning in metadata_dst memcpy")

Link: https://lore.kernel.org/all/53D1D353-B8F6-4ADC-8F29-8C48A7C9C6F1@kernel.org/
Suggested-by: Kees Cook <kees@kernel.org>
Reviewed-by: Cosmin Ratiu <cratiu@nvidia.com>
Reviewed-by: Tariq Toukan <tariqt@nvidia.com>
Signed-off-by: Gal Pressman <gal@nvidia.com>
---
Changelog -
v1->v2: https://lore.kernel.org/netdev/20250209101853.15828-1-gal@nvidia.com/
* Remove change in struct layout, align 'options' field explicitly (Ilya, Kees, Jakub).
* Change allocation I missed in v1 in metadata_dst_alloc_percpu().
---
 .../mellanox/mlx5/core/en/tc_tun_encap.c      |  4 +---
