Return-Path: <netdev+bounces-127837-lists+netdev=lfdr.de@vger.kernel.org>
X-Original-To: lists+netdev@lfdr.de
Delivered-To: lists+netdev@lfdr.de
Received: from sy.mirrors.kernel.org (sy.mirrors.kernel.org [IPv6:2604:1380:40f1:3f00::1])
	by mail.lfdr.de (Postfix) with ESMTPS id 3BF0B976CCE
	for <lists+netdev@lfdr.de>; Thu, 12 Sep 2024 16:56:03 +0200 (CEST)
Received: from smtp.subspace.kernel.org (wormhole.subspace.kernel.org [52.25.139.140])
	(using TLSv1.2 with cipher ECDHE-RSA-AES256-GCM-SHA384 (256/256 bits))
	(No client certificate requested)
	by sy.mirrors.kernel.org (Postfix) with ESMTPS id 177F8B20CFE
	for <lists+netdev@lfdr.de>; Thu, 12 Sep 2024 14:56:00 +0000 (UTC)
Received: from localhost.localdomain (localhost.localdomain [127.0.0.1])
	by smtp.subspace.kernel.org (Postfix) with ESMTP id A0B7419C552;
	Thu, 12 Sep 2024 14:55:55 +0000 (UTC)
Authentication-Results: smtp.subspace.kernel.org;
	dkim=pass (2048-bit key) header.d=foss.st.com header.i=@foss.st.com header.b="vuZuHX2A"
X-Original-To: netdev@vger.kernel.org
Received: from mx07-00178001.pphosted.com (mx07-00178001.pphosted.com [185.132.182.106])
	(using TLSv1.2 with cipher ECDHE-RSA-AES256-GCM-SHA384 (256/256 bits))
	(No client certificate requested)
	by smtp.subspace.kernel.org (Postfix) with ESMTPS id 1F7C415D5D9
	for <netdev@vger.kernel.org>; Thu, 12 Sep 2024 14:55:50 +0000 (UTC)
Authentication-Results: smtp.subspace.kernel.org; arc=none smtp.client-ip=185.132.182.106

Message-ID: <0ff0672d-9c36-4ff6-b863-3dce83d4d172@foss.st.com>
Date: Thu, 12 Sep 2024 16:51:51 +0200
Precedence: bulk
X-Mailing-List: netdev@vger.kernel.org
List-Id: <netdev.vger.kernel.org>
List-Subscribe: <mailto:netdev+subscribe@vger.kernel.org>
List-Unsubscribe: <mailto:netdev+unsubscribe@vger.kernel.org>
MIME-Version: 1.0
User-Agent: Mozilla Thunderbird
Subject: Re: [BUG] Regression with commit: ptp: Add .getmaxphase callback to
 ptp_clock_info
To: Richard Cochran <richardcochran@gmail.com>
CC: Rahul Rameshbabu <rrameshbabu@nvidia.com>, <netdev@vger.kernel.org>,
        "David S. Miller" <davem@davemloft.net>,
        Jakub Kicinski <kuba@kernel.org>, Shuah Khan <shuah@kernel.org>,
        Maciek Machnikowski <maciek@machnikowski.net>
References: <8aac51e0-ce2d-4236-b16e-901f18619103@foss.st.com>
 <Zt8V3dmVGSsj2nKy@hoboy.vegasvil.org>
 <b7f33997-de4e-4a3d-ab1e-0e8fc77854ec@foss.st.com>
 <ZuEZG6DM3SUdkE62@hoboy.vegasvil.org>
Content-Language: en-US
From: Christophe ROULLIER <christophe.roullier@foss.st.com>
In-Reply-To: <ZuEZG6DM3SUdkE62@hoboy.vegasvil.org>
X-ClientProxiedBy: SHFCAS1NODE2.st.com (10.75.129.73) To SHFDAG1NODE2.st.com
 (10.75.129.70)
X-Proofpoint-Virus-Version: vendor=baseguard
 engine=ICAP:2.0.293,Aquarius:18.0.1039,Hydra:6.0.680,FMLib:17.12.60.29
 definitions=2024-09-06_09,2024-09-06_01,2024-09-02_01

--------------vlpiNEtJPrTVIuJXrh4TLfDC
Content-Type: text/plain; charset="UTF-8"; format=flowed
Content-Transfer-Encoding: 8bit

Hi Richard,


I put in attachment result of pahole.

It is :

struct ptp_clock_caps {
     int                        max_adj;              /*     0 4 */
     int                        n_alarm;              /*     4 4 */
     int                        n_ext_ts;             /*     8 4 */
     int                        n_per_out;            /*    12 4 */
     int                        pps;                  /*    16 4 */
     int                        n_pins;               /*    20 4 */
     int                        cross_timestamping;   /*    24 4 */
     int                        adjust_phase;         /*    28 4 */
     int                        max_phase_adj;        /*    32 4 */
     int                        rsv[11];              /*    36 44 */

     /* size: 80, cachelines: 2, members: 10 */
     /* last cacheline: 16 bytes */
};

ptp4l used: ptp4l -v
4.1

Thanks,

BR

Christophe

On 9/11/24 06:14, Richard Cochran wrote:
> On Tue, Sep 10, 2024 at 08:49:57AM +0200, Christophe ROULLIER wrote:
>> I've tested with platform 32bits and 64 bits and I have same error.
>>
>> Toolchain/compiler used are:
>>
>> aarch64-ostl-linux-gcc --version
>> aarch64-ostl-linux-gcc (GCC) 11.3.0
>> or
>>
>> arm-ostl-linux-gnueabi-gcc --version
>> arm-ostl-linux-gnueabi-gcc (GCC) 12.2.0
> Something is off.
>
> Can you run `pahole` on the ptp4l binaries that you are using, and
> check the layout of `struct ptp_clock_caps` ?
>
> It should look something like the ones below...
>
> Thanks,
> Richard
>
> ---
> struct ptp_clock_caps1 {
>          int                        max_adj;              /*     0     4 */
>          int                        n_alarm;              /*     4     4 */
>          int                        n_ext_ts;             /*     8     4 */
>          int                        n_per_out;            /*    12     4 */
>          int                        pps;                  /*    16     4 */
>          int                        rsv[15];              /*    20    60 */
>
>          /* size: 80, cachelines: 2, members: 6 */
>          /* last cacheline: 16 bytes */
> };
> struct ptp_clock_caps2 {
>          int                        max_adj;              /*     0     4 */
>          int                        n_alarm;              /*     4     4 */
>          int                        n_ext_ts;             /*     8     4 */
>          int                        n_per_out;            /*    12     4 */
>          int                        pps;                  /*    16     4 */
>          int                        n_pins;               /*    20     4 */
>          int                        cross_timestamping;   /*    24     4 */
>          int                        adjust_phase;         /*    28     4 */
>          int                        rsv[12];              /*    32    48 */
>
>          /* size: 80, cachelines: 2, members: 9 */
>          /* last cacheline: 16 bytes */
> };
> struct ptp_clock_caps3 {
>          int                        max_adj;              /*     0     4 */
>          int                        n_alarm;              /*     4     4 */
>          int                        n_ext_ts;             /*     8     4 */
>          int                        n_per_out;            /*    12     4 */
>          int                        pps;                  /*    16     4 */
>          int                        n_pins;               /*    20     4 */
>          int                        cross_timestamping;   /*    24     4 */
>          int                        adjust_phase;         /*    28     4 */
>          int                        max_phase_adj;        /*    32     4 */
>          int                        rsv[11];              /*    36    44 */
>
>          /* size: 80, cachelines: 2, members: 10 */
>          /* last cacheline: 16 bytes */
> };
--------------vlpiNEtJPrTVIuJXrh4TLfDC
Content-Type: text/plain; charset="UTF-8"; name="pahole_ptp4l_aarch64"
Content-Disposition: attachment; filename="pahole_ptp4l_aarch64"
Content-Transfer-Encoding: base64

c3RydWN0IF9JT19GSUxFIHsKCWludCAgICAgICAgICAgICAgICAgICAgICAgIF9mbGFnczsg
ICAgICAgICAgICAgICAvKiAgICAgMCAgICAgNCAqLwoKCS8qIFhYWCA0IGJ5dGVzIGhvbGUs
IHRyeSB0byBwYWNrICovCgoJY2hhciAqICAgICAgICAgICAgICAgICAgICAgX0lPX3JlYWRf
cHRyOyAgICAgICAgIC8qICAgICA4ICAgICA4ICovCgljaGFyICogICAgICAgICAgICAgICAg
ICAgICBfSU9fcmVhZF9lbmQ7ICAgICAgICAgLyogICAgMTYgICAgIDggKi8KCWNoYXIgKiAg
ICAgICAgICAgICAgICAgICAgIF9JT19yZWFkX2Jhc2U7ICAgICAgICAvKiAgICAyNCAgICAg
OCAqLwoJY2hhciAqICAgICAgICAgICAgICAgICAgICAgX0lPX3dyaXRlX2Jhc2U7ICAgICAg
IC8qICAgIDMyICAgICA4ICovCgljaGFyICogICAgICAgICAgICAgICAgICAgICBfSU9fd3Jp
